000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/РеквизитыКонтрагентов/РеквизитыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеквизитыКонтрагентов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КлиентMagentoII</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодПроекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаименованиеУкраинское</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательМаржинальности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/РеквизитыКонтрагентов/RecordSetModule.bsl
//	LNK 29.04.2024 06:31:21
Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	Если НЕ Количество() = 0 Тогда

		ПроверитьЗащищённыеРеквизиты(Отказ);

	КонецЕсли;

КонецПроцедуры

//	LNK 29.04.2024 06:36:02
Процедура ПроверитьЗащищённыеРеквизиты(Отказ)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаРегистра.Период КАК Период,
	|	ТаблицаРегистра.Блокирован КАК Блокирован,
	|	ТаблицаРегистра.КлиентMagentoII КАК КлиентMagentoII,
	|	ТаблицаРегистра.Код КАК Код,
	|	ТаблицаРегистра.КодПоставщика КАК КодПоставщика,
	|	ТаблицаРегистра.КодПроекта КАК КодПроекта,
	|	ТаблицаРегистра.Наименование КАК Наименование,
	|	ТаблицаРегистра.НаименованиеУкраинское КАК НаименованиеУкраинское,
	|	ТаблицаРегистра.ПоказательМаржинальности КАК ПоказательМаржинальности,
	|	ТаблицаРегистра.УчетнаяЗапись КАК УчетнаяЗапись,
	|	ТаблицаРегистра.Примечание КАК Примечание
	|ИЗ
	|	РегистрСведений.РеквизитыКонтрагентов.СрезПоследних(&Период, Контрагент = &Контрагент) КАК ТаблицаРегистра"
	);
	Запрос.УстановитьПараметр("Период"		, Отбор.Период.Значение - 1);
	Запрос.УстановитьПараметр("Контрагент"	, Отбор.Контрагент.Значение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда

		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();

		Для каждого ЗаписьНабора Из ЭтотОбъект Цикл

			Если Выборка.КлиентMagentoII = Истина Тогда

				ЗаписьНабора.КлиентMagentoII = Истина;

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры
